pandaGaume/mcp-broker/c/espressif/samples/provider/sdkconfig.defaults
# Target: any ESP32 with Wi-Fi. The S3 is what this sample is developed on,
# on an Arduino Nano ESP32 (S3R8): 16 MB of flash. IDF's default is 2 MB,
# which leaves a 1 MB app partition and this sample already fills 90% of
# it. A board with less flash sets its real size in menuconfig
# (Serial flasher config), the bootloader refuses to boot an image that
# claims more than the chip has.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
CONFIG_PARTITION_TABLE_FILENAME="partitions_singleapp_large.csv"

# The broker is reached over TLS in production; the bundle is what validates
# its certificate without shipping one in the firmware.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y

# One provider socket plus Wi-Fi is well within the defaults; nothing to
# raise here. Keep the log readable.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
